apache/nuttx/arch/arm/src/stm32wb/hardware/stm32wbxx_pinmap.h
#if defined(CONFIG_STM32WB_IO_CONFIG_C_48E)
#  define GPIO_TIM2_CH1IN_4     (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN15)
#  define GPIO_TIM2_CH1OUT_4    (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN15)
#  define GPIO_TIM2_CH2IN_3     (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN12)
#  define GPIO_TIM2_CH2OUT_3    (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#  define GPIO_TIM2_CH3IN_3     (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN13)
#  define GPIO_TIM2_CH3OUT_3    (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#endif

#if defined(CONFIG_STM32_STM32WB30) || defined(CONFIG_STM32_STM32WB50) \
    || defined(CONFIG_STM32_STM32WB35) || defined(CONFIG_STM32_STM32WB55)

#define GPIO_TIM16_BKIN_0       (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM16_CH1IN_1      (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM16_CH1OUT_1     (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM16_CH1IN_2      (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM16_CH1OUT_2     (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM16_CH1N_0       (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TIM16_CH1IN_3    (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTE | GPIO_PIN0)
#  define GPIO_TIM16_CH1OUT_3   (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN0)
#endif

#define GPIO_TIM17_BKIN_0       (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM17_CH1IN_1      (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM17_CH1OUT_1     (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM17_CH1IN_2      (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM17_CH1OUT_2     (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM17_CH1N_0       (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TIM17_CH1IN_3    (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTE | GPIO_PIN1)
#  define GPIO_TIM17_CH1OUT_3   (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN1)
#endif

#endif /* defined(CONFIG_STM32_STM32WB30) || defined(CONFIG_STM32_STM32WB50) || defined(CONFIG_STM32_STM32WB35) || defined(CONFIG_STM32_STM32WB55) */

#define GPIO_LPTIM1_ETR_1       (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LPTIM1_OUT_1       (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_LPTIM1_OUT_2       (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_LPTIM1_IN1_1       (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_LPTIM1_IN2_1       (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN7)

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_LPTIM1_ETR_2     (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN3)
#  define GPIO_LPTIM1_IN1_2     (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN0)
#  define GPIO_LPTIM1_OUT_3     (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN1)
#  define GPIO_LPTIM1_IN2_2     (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN2)
#endif

#define GPIO_LPTIM2_ETR_1       (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_LPTIM2_OUT_1       (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_LPTIM2_OUT_2       (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_LPTIM2_IN1_1       (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN1)

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_LPTIM2_ETR_2     (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN3)
#  define GPIO_LPTIM2_IN1_2     (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN0)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_LPTIM2_ETR_3     (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN11)
#  define GPIO_LPTIM2_OUT_3     (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN13)
#  define GPIO_LPTIM2_IN1_3     (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN12)
#endif

/* Touch Screen Controller */

#if defined(CONFIG_STM32_STM32WB10) || defined(CONFIG_STM32_STM32WB15) || defined(CONFIG_STM32_STM32WB55)

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_SYNC_1       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN10)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_SYNC_2       (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN2)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V) || defined(CONFIG_STM32WB_IO_CONFIG_C_48E)
#  define GPIO_TSC_G1_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN12)
#  define GPIO_TSC_G1_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN13)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G1_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN14)
#  define GPIO_TSC_G1_IO4_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN15)
#endif

#define GPIO_TSC_G2_IO1_0       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TSC_G2_IO2_0       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TSC_G2_IO3_0       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TSC_G2_IO4_0       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN7)

#if !defined(CONFIG_STM32WB_IO_CONFIG_C_49)
#  define GPIO_TSC_G3_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN15)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G3_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN10)
#  define GPIO_TSC_G3_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN11)
#  define GPIO_TSC_G3_IO4_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN12)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_C_48E)
#  define GPIO_TSC_G3_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN10)
#  define GPIO_TSC_G3_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN1)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G4_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN6)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G4_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN7)
#  define GPIO_TSC_G4_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN8)
#  define GPIO_TSC_G4_IO4_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN9)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G5_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN4)
#  define GPIO_TSC_G5_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN5)
#  define GPIO_TSC_G5_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN6)
#  define GPIO_TSC_G5_IO4_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN7)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G6_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN10)
#  define GPIO_TSC_G6_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN11)
#  define GPIO_TSC_G6_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN12)
#  define GPIO_TSC_G6_IO4_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN13)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TSC_G7_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN0)
#  define GPIO_TSC_G7_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN1)
#  define GPIO_TSC_G7_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN2)
#endif

#if defined(CONFIG_STM32_STM32WB15)
#  define GPIO_TSC_G7_IO1_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN13)
#  define GPIO_TSC_G7_IO2_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN10)
#  define GPIO_TSC_G7_IO3_0     (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN8)
#endif

#define GPIO_TSC_G7_IO4_0       (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN9)

#endif /* defined(CONFIG_STM32_STM32WB10) || defined(CONFIG_STM32_STM32WB15) || defined(CONFIG_STM32_STM32WB55) */

/* IR interface (with timers 16 and 17) */

#if defined(CONFIG_STM32_STM32WB30) || defined(CONFIG_STM32_STM32WB50) \
    || defined(CONFIG_STM32_STM32WB35) || defined(CONFIG_STM32_STM32WB55)
#  define GPIO_IR_OUT_1         (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN13)
#  define GPIO_IR_OUT_2         (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN9)
#endif

/* Trace port */

#if defined(CONFIG_STM32WB_IO_CONFIG_R) || defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TRACED1_0        (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN10)
#  define GPIO_TRACED3_0        (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN12)
#endif

#if defined(CONFIG_STM32WB_IO_CONFIG_V)
#  define GPIO_TRACECK_0        (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN2)
#  define GPIO_TRACED0_0        (GPIO_ALT | GPIO_AF0 | GPIO_PORTD | GPIO_PIN9)
#  define GPIO_TRACED2_0        (GPIO_ALT | GPIO_AF0 | GPIO_PORTD | GPIO_PIN2)
#endif

/* USART/LPUART */

